src/Documents/РасчетСебестоимостиВыпуска/РасчетСебестоимостиВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетСебестоимостиВыпуска</name>
  <comment>(Общ)</comment>
  <registerRecords>AccumulationRegister.КорректировкиНезавершенноеПроизводствоНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.НоменклатураИсключаемаяИзБазыРаспределения</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводстве</registerRecords>
  <registerRecords>InformationRegister.БазаРаспределенияЗатратМеждународныйУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеПродукцииПоПеределамОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиСтроительствоОбъектовОсновныхСредствНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬБракВПроизводствеНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахМеждународныйУчет</registerRecords>
  <registerRecords>InformationRegister.БазаРаспределенияЗатратБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводствеМеждународныйУчет</registerRecords>
  <registerRecords>InformationRegister.БазаРаспределенияЗатрат</registerRecords>
  <registerRecords>InformationRegister.УДАЛИТЬБазаРаспределенияЗатратНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводствоМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОС</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.КорректировкаВстречногоВыпускаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиБракВПроизводствеНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровПереданные</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиПартииТоваровНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬЗатратыНаВыпускПродукцииНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.НоменклатураИсключаемаяИзБазыРаспределенияОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииНаработкаБухгалтерскийУчет</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬПартииМатериаловВЭксплуатацииНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводствеБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатратРегл</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровПереданныеМеждународныйУчет</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаСтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬПартииТоваровПереданныеНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииМатериаловВЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыОбороты</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровПереданныеБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеПродукцииПоПеределам</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬПартииТоваровНаСкладахНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬВыпускПродукцииНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УчетПродажИСебестоимости</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеЗатратПоПеределам</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬНезавершенноеПроизводствоНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводствоБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииМатериаловВЭксплуатацииБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.СтроительствоОбъектовОсновныхСредствБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиСебестоимость</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОС</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>InformationRegister.УзлыКорректировкиСтоимостиСписания</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаВыпускПродукцииНаработка</registerRecords>
  <registerRecords>InformationRegister.УДАЛИТЬРаспределениеВыпускаБухгалтерскийУчетНаВыпускНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.РаспределениеЗатратПоПеределамОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОС</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииМатериаловВЭксплуатацииМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиСебестоимостьБухгалтерскийУчет</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВМеждународномУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполняемыеДействия</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ВыполняемоеДействие</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.ВыполняемыеОперацииРасчетСебестоимостиВыпуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнять</name>
      <comment>(Общ)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидыОтраженияВУчете/ВидыОтраженияВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтраженияВУчете</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОтражатьВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВБухгалтерскомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВНалоговомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВРегламентированномУчете</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РасчетСебестоимостиВыпуска/Forms/ФормаДокументаУправляемая/Module.bsl
// Процедура заполняет значение переключателя "ВидОтраженияВУчете".
//
&НаКлиенте
Процедура ЗаполнитьВидОтраженияВУчете()
	
	Если Объект.ОтражатьВУправленческомУчете Тогда
		ВидОтраженияВУчете = ПредопределенноеЗначение("Перечисление.ВидыОтраженияВУчете.ОтражатьВУправленческомУчете");
		
	Иначе
		ВидОтраженияВУчете = ПредопределенноеЗначение("Перечисление.ВидыОтраженияВУчете.ОтражатьВРегламентированномУчете");
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьВидОтраженияВУчете()

&НаСервере
Функция ПолучитьИспользованиеРасширеннойАналитики(Дата)
	Возврат УправлениеЗапасами.ИспользуетсяРасширеннаяАналитикаУчета(Дата);
КонецФункции	

&НаСервере
Процедура ПроверитьВозможностьОткрытияФормы(ДокументОбъект, Отказ)
	
	ТекстСообщения = "";
	
	ИспользоватьРасширеннуюАналитику = ПолучитьИспользованиеРасширеннойАналитики(Объект.Дата);
	Если НЕ ИспользоватьРасширеннуюАналитику Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Не используется ""Расширенная аналитика учета затрат""'")
			+ Символы.ПС + НСтр("ru = 'В управляемом режиме этот документ открыть нельзя'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект,,, Отказ);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыполняемыеДействия()

	МассивДействий = ПроцедурыРасчетаСебестоимостиВыпуска.ПолучитьМассивВыполняемыхДействий(Объект.ПериодРегистрации, Объект.Организация, Объект.ОтражатьВУправленческомУчете, Объект.ОтражатьВБухгалтерскомУчете, Истина);
	
	Объект.ВыполняемыеДействия.Очистить();
	Для Каждого ТекущееДействие Из МассивДействий Цикл
		НоваяСтрока = Объект.ВыполняемыеДействия.Добавить();
		НоваяСтрока.ВыполняемоеДействие = ТекущееДействие;
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает видимость реквизитов в зависимости от установленных флажков
//  по типам учета.
//
// Параметры
//  Нет.
//
&НаКлиенте
Процедура УстановитьВидимостьРеквизитовПоТипуУчета()

	Если Объект.ОтражатьВУправленческомУчете Тогда
		Элементы.Организация.Доступность = Ложь;
	Иначе
		Элементы.Организация.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьРеквизитовПоТипуУчета()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Проверка: не должны быть заполнены данные, которые на форме не отражаются или не поддерживаются
	//Проверять надо и для нового документа: реквизиты могли заполниться неправильными значениями по умолчанию
	ПроверитьВозможностьОткрытияФормы(Объект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// Это существующий документ. 
		// Проверим, что его можно менять.
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(РеквизитФормыВЗначение("Объект"), ЭтаФорма);

	КонецЕсли;
	мТекущаяДатаДокумента = Объект.Дата; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВидОтраженияВУчете();
	УстановитьВидимостьРеквизитовПоТипуУчета();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьСписокВыполняемыхДействий(Команда)
		Если Объект.ВыполняемыеДействия.Количество() > 0 Тогда
	 
		Ответ = Вопрос("В документе уже присутствуют строки." + Символы.ПС
					 + "При заполнении они будут удалены!" + Символы.ПС
					 + "Продолжить?", РежимДиалогаВопрос.ДаНет,,
					 КодВозвратаДиалога.Нет, "Заполнить список действий");
					 
		Если Не Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Объект.ВыполняемыеДействия.Очистить();
	КонецЕсли;
	
	ЗаполнитьВыполняемыеДействия();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если НЕ ПустаяСтрока(Объект.Номер) Тогда
		ПрефиксацияОбъектовСобытия.ОчиститьНомерОбъекта(Объект.Номер, Объект.Организация);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода даты документа.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	Если НЕ ПолучитьИспользованиеРасширеннойАналитики(Объект.Дата) Тогда
		Предупреждение("На указанную дату не используется ""Расширенная аналитика учета затрат""" + Символы.ПС
						+ "Будет восстановлено предыдущее значение даты");
		Объект.Дата = мТекущаяДатаДокумента;
		Возврат;
	КонецЕсли;	
	
	мТекущаяДатаДокумента = Объект.Дата;
	Если НачалоМесяца(Объект.ПериодРегистрации) <> НачалоМесяца(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;	
КонецПроцедуры // ДатаПриИзменении()

// Процедура - обработчик события "ПриИзменении" флага отражения
// документа в управленческом учете.
//
&НаКлиенте
Процедура ВидОтраженияВУчетеПриИзменении(Элемент)
	
	Объект.ОтражатьВУправленческомУчете = (ВидОтраженияВУчете = ПредопределенноеЗначение("Перечисление.ВидыОтраженияВУчете.ОтражатьВУправленческомУчете"));
	Объект.ОтражатьВБухгалтерскомУчете = (ВидОтраженияВУчете = ПредопределенноеЗначение("Перечисление.ВидыОтраженияВУчете.ОтражатьВРегламентированномУчете"));

	УстановитьВидимостьРеквизитовПоТипуУчета();
	
КонецПроцедуры // ВидОтраженияВУчетеПриИзменении()

&НаКлиенте
Процедура ВыполняемыеДействияВыполняемоеДействиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элемент.СписокВыбора.ЗагрузитьЗначения(ПроцедурыРасчетаСебестоимостиВыпуска.ПолучитьМассивВыполняемыхДействий(
		Объект.ПериодРегистрации, 
		Объект.Организация, 
		Объект.ОтражатьВУправленческомУчете, 
		Объект.ОтражатьВБухгалтерскомУчете, // В форме флаг ОтражатьВБухгалтерскомУчете - это отражение и в бух. и в нал. учете
		Истина));	
КонецПроцедуры
